<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"da0c8fb1947afac31a03e4706e7834aa4ac84f7c85bafb8060b03b515ee6c200","plan_job_ref":"Job Terraform Plan #768 at https://github.com/cal-itp/data-infra/actions/runs/20835194701","plan_out_hash":"ccf2744293420260866e1460b69b0247dec199a54918afc58d6496fb4775d81c","plan_hash":"a68c8ec4874c2c7153a987077beee85a71acb30713fe8f7ed8e52ae1edaebda6","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/gcs/us__
<details>
<summary>Plan: 2 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket.calitp["cal-itp-data-infra-enghouse-raw"] will be created
+   resource "google_storage_bucket" "calitp" {
+       default_event_based_hold    = false
+       effective_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       force_destroy               = false
+       id                          = (known after apply)
+       location                    = "US-WEST2"
+       name                        = "cal-itp-data-infra-enghouse-raw"
+       project                     = "cal-itp-data-infra"
+       project_number              = (known after apply)
+       public_access_prevention    = "inherited"
+       requester_pays              = false
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       time_created                = (known after apply)
+       uniform_bucket_level_access = true
+       updated                     = (known after apply)
+       url                         = (known after apply)

+       soft_delete_policy (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # google_storage_bucket.tfer--rt-parsed-deprecated will be updated in-place
!~  resource "google_storage_bucket" "tfer--rt-parsed-deprecated" {
        id                          = "rt-parsed-deprecated"
        name                        = "rt-parsed-deprecated"
!~      terraform_labels            = {
+           "deprecated" = (known after apply)
        }
#        (16 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # google_storage_bucket_iam_binding.calitp["cal-itp-data-infra-enghouse-raw"] will be created
+   resource "google_storage_bucket_iam_binding" "calitp" {
+       bucket  = "cal-itp-data-infra-enghouse-raw"
+       etag    = (known after apply)
+       id      = (known after apply)
+       members = [
+           "projectEditor:cal-itp-data-infra",
+           "projectOwner:cal-itp-data-infra",
        ]
+       role    = "roles/storage.legacyObjectOwner"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #768](https://github.com/cal-itp/data-infra/actions/runs/20835194701)